# Group

### Groupby

groupby() is a very powerful function with a lot of variations.

It makes the task of splitting the dataframe over some criteria really easy and efficient.

Any groupby operation involves one of the following operations on the original object. They are −
   - Splitting the Object
   - Applying a function
   - Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. In the apply functionality, we can perform the following operations −
   - Aggregation − computing a summary statistic
   - Transformation − perform some group-specific operation
   - Filtration − discarding the data with some condition

##### Syntax

In [ ]:
.groupby(by=None, axis=0, level=None, as_index=True, sort=True, 
         group_keys=True, squeeze=False, **kwargs)

by :         mapping, function, str, or iterable
axis :       int, default 0
level :      If the axis is a MultiIndex (hierarchical), group by a particular level or levels
as_index :   For aggregated output, return object with group labels as the index. 
sort :       Sort group keys. Get better performance by turning this off. 
group_keys : When calling apply, add group keys to index to identify pieces
squeeze :    Reduce the dimensionality of the return type if possible

In [ ]:
Pandas object can be split into any of their objects. 
There are multiple ways to split an object like −
   - obj.groupby('key')
   - obj.groupby(['key1','key2'])
   - obj.groupby(key,axis=1)

##### Examples

In [ ]:
Examples of use

# Group by the name of sales rep
df.groupby(f['Sales Rep'].str.split(' ').str[0]).size()

# Grouping by whether or not there is a “William” in the name of the rep
df.groupby(df['Sales Rep'].apply(lambda x: 'William' in x)).size()

# Group by random series (for illustrative purposes only)
df.groupby(pd.Series(np.random.choice(list('ABCDG'),len(df)))).size()

# Grouping by three evenly cut “Val” buckets
df.groupby(pd.qcut(x=df['Val'],q=3,labels=['low','mid','high'])).size()

# Grouping by custom-sized “Val” buckets
df.groupby(pd.cut(df['Val'],[0,3000,5000,7000,10000])).size()

# Using Grouper for looking at dates 
df.groupby(pd.Grouper(key='Date',freq='Y')).size()    #(years here)
df.groupby(pd.Grouper(key='Date',freq='Q')).size()    #(quarters here)

# Grouping by multiple columns
df.groupby(['Sales Rep','Company Name']).size()

###### Example 1 (group, get group, 2 levels of group)

In [226]:
import pandas as pd 
df = pd.read_csv("nba.csv") 
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-Feb,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,6-May,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,6-May,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,6-Oct,231,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,6-Oct,234,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8,PG,26,6-Mar,203,Butler,2433333.0
454,Raul Neto,Utah Jazz,25,PG,24,6-Jan,179,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21,C,26,7-Mar,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,7-0,231,Kansas,947276.0

In [227]:
gk = df.groupby('Team') 
gk.first()     #to print the first entries in all the group formed

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Atlanta Hawks,Kent Bazemore,24,SF,26,6-May,201,Old Dominion,2000000.0
Boston Celtics,Avery Bradley,0,PG,25,6-Feb,180,Texas,7730337.0
Brooklyn Nets,Bojan Bogdanovic,44,SG,27,6-Aug,216,Oklahoma State,3425510.0
Charlotte Hornets,Nicolas Batum,5,SG,27,6-Aug,200,Virginia Commonwealth,13125306.0
Chicago Bulls,Cameron Bairstow,41,PF,25,6-Sep,250,New Mexico,845059.0
Cleveland Cavaliers,Matthew Dellavedova,8,PG,25,6-Apr,198,Saint Mary's,1147276.0
Dallas Mavericks,Justin Anderson,1,SG,22,6-Jun,228,Virginia,1449000.0
Denver Nuggets,Darrell Arthur,0,PF,28,6-Sep,235,Kansas,2814000.0
Detroit Pistons,Joel Anthony,50,C,33,6-Sep,245,UNLV,2500000.0
Golden State Warriors,Leandro Barbosa,19,SG,33,6-Mar,194,North Carolina,2500000.0
Houston Rockets,Trevor Ariza,1,SF,30,6-Aug,215,UCLA,8193030.0
Indiana Pacers,Lavoy Allen,5,PF,27,6-Sep,255,Temple,4050000.0
Los Angeles Clippers,Cole Aldrich,45,C,27,6-Nov,250,Kansas,1100602.0
Los Angeles Lakers,Brandon Bass,2,PF,31,6-Aug,250,LSU,3000000.0
Memphis Grizzlies,Jordan Adams,3,SG,21,6-May,209,UCLA,1404600.0
Miami Heat,Chris Bosh,1,PF,32,6-Nov,235,Georgia Tech,22192730.0
Milwaukee Bucks,Giannis Antetokounmpo,34,SF,21,6-Nov,222,Arizona,1953960.0
Minnesota Timberwolves,Nemanja Bjelica,88,PF,28,6-Oct,240,Louisville,3950001.0
New Orleans Pelicans,Alexis Ajinca,42,C,28,7-Feb,248,California,4389607.0
New York Knicks,Arron Afflalo,4,SG,30,6-May,210,UCLA,8000000.0
Oklahoma City Thunder,Steven Adams,12,C,22,7-0,255,Pittsburgh,2279040.0
Orlando Magic,Dewayne Dedmon,3,C,26,7-0,245,USC,947276.0
Philadelphia 76ers,Elton Brand,42,PF,37,6-Sep,254,Duke,947276.0
Phoenix Suns,Eric Bledsoe,2,PG,26,6-Jan,190,Kentucky,13500000.0
Portland Trail Blazers,Cliff Alexander,34,PF,20,6-Aug,240,Kansas,525093.0
Sacramento Kings,Quincy Acy,13,SF,25,6-Jul,240,Baylor,981348.0
San Antonio Spurs,LaMarcus Aldridge,12,PF,30,6-Nov,240,Texas,19689000.0
Toronto Raptors,Bismack Biyombo,8,C,23,6-Sep,245,Missouri,2814000.0
Utah Jazz,Trevor Booker,33,PF,28,6-Aug,228,Clemson,4775000.0
Washington Wizards,Alan Anderson,6,SG,33,6-Jun,220,Michigan State,4000000.0

In [228]:
gk.get_group('Boston Celtics')

,Name,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,0,PG,25,6-Feb,180,Texas,7730337.0
1,Jae Crowder,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,30,SG,27,6-May,205,Boston University,NaN
3,R.J. Hunter,28,SG,22,6-May,185,Georgia State,1148640.0
4,Jonas Jerebko,8,PF,29,6-Oct,231,NaN,5000000.0
5,Amir Johnson,90,PF,29,6-Sep,240,NaN,12000000.0
6,Jordan Mickey,55,PF,21,6-Aug,235,LSU,1170960.0
7,Kelly Olynyk,41,C,25,7-0,238,Gonzaga,2165160.0
8,Terry Rozier,12,PG,22,6-Feb,190,Louisville,1824360.0
9,Marcus Smart,36,PG,22,6-Apr,220,Oklahoma State,3431040.0
10,Jared Sullinger,7,C,24,6-Sep,260,Ohio State,2569260.0
11,Isaiah Thomas,4,PG,27,5-Sep,185,Washington,6912869.0
12,Evan Turner,11,SG,27,6-Jul,220,Ohio State,3425510.0
13,James Young,13,SG,20,6-Jun,215,Kentucky,1749840.0
14,Tyler Zeller,44,C,26,7-0,253,North Carolina,2616975.0

In [229]:
gkk = df.groupby(['Team', 'Position']) 
gkk.first()

                                         Name  Number  Age Height  Weight  \
Team               Position
Atlanta Hawks      C               Al Horford      15   30  6-Oct     245
                   PF          Kris Humphries      43   31  6-Sep     235
                   PG         Dennis Schroder      17   22  6-Jan     172
                   SF           Kent Bazemore      24   26  6-May     201
                   SG        Tim Hardaway Jr.      10   24  6-Jun     205
...                                       ...     ...  ...    ...     ...
Washington Wizards C            Marcin Gortat      13   32  6-Nov     240
                   PF             Drew Gooden      90   34  6-Oct     250
                   PG          Ramon Sessions       7   30  6-Mar     190
                   SF            Jared Dudley       1   30  6-Jul     225
                   SG           Alan Anderson       6   33  6-Jun     220

                                          College      Salary
Team               Position
Atlanta Hawks      C                      Florida  12000000.0
                   PF                   Minnesota   1000000.0
                   PG                 Wake Forest   1763400.0
                   SF                Old Dominion   2000000.0
                   SG                    Michigan   1304520.0
...                                           ...         ...
Washington Wizards C         North Carolina State  11217391.0
                   PF                      Kansas   3300000.0
                   PG                      Nevada   2170465.0
                   SF              Boston College   4375000.0
                   SG              Michigan State   4000000.0

[149 rows x 7 columns]

###### Example 2

In [231]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [237]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [238]:
# Group by with multiple columns
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [236]:
# Iterating through groups, with groupby object in hand
grouped = df.groupby('Year')
for name,group in grouped:
   print(name)
   print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

### Selection

In [ ]:
get_group()      to select a single group
.size            to get the number of rowns in each group
pd.Grouper       when working with time-series

### Aggregations

- An aggregated function returns a single aggregated value for each group. 
- Once the group by object is created, several aggregation operations can be performed on the grouped data.
- An obvious one is aggregation via the aggregate or equivalent agg method

In [ ]:
Most used functions with agg

- 'size':              Counts the rows 
- 'sum':               Sums the column up
- 'mean'/'median':     Mean/Median of the column
- 'max'/'min':         Maximum/Minimum of the column
- 'idxmax'/'idxmin':   Index of the min/max of the column.
- pd.Series.nunique:   Counts unique values. this is a function actually (not a string)

In [241]:
import pandas as pd
import numpy as np

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [242]:
#Attribute Access in Python Pandas
grouped = df.groupby('Team')
grouped.agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [244]:
# Multiple Aggregation (sum, mean, stdev)
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

##### pd.NamedAgg

- When applying multiple aggregation functions to multiple columns the result gets a bit messy
- The main issue: there is no control over the column names. 
- Situations like this are where pd.NamedAgg comes in handy. 
- pd.NamedAgg allows to specify the name of the target column.

In [ ]:
# Long Form: Explictly specifying the NamedAgg
aggregation = {
    'Potential Sales': pd.NamedAgg(column='Val', aggfunc='size'),
    'Sales': pd.NamedAgg(column='Sale', aggfunc='sum'),
    'Conversion Rate': pd.NamedAgg(column='Sale', aggfunc=cr)
}
# Alternative: Since the NamedAgg is just a tuple, we can also pass regular tuples
aggregation = {
    'Potential Sales': ('Val','size'),
    'Sales': ('Sale','sum'),
    'Conversion Rate': ('Sale',cr)
}

### Transformation

- Transformation returns an object that is indexed the same size of that is being grouped. 
- Thus, the transform should return a result that is the same size as that of a group chunk.

In [245]:
import pandas as pd
import numpy as np

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Team')
score = lambda x: (x - x.mean()) / x.std()*10
grouped.transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [ ]:
# percentage of the groups total by dividing by the group-wise sum.
df.groupby('Sales Rep')['Val'].transform(lambda x: x/sum(x))

### Filtration

- Filtration filters the data on a defined criteria and returns the subset of data. 
- The filter() function is used to filter the data.

In [248]:
import pandas as pd
import numpy as np

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

# In the above filter condition, we are asking to return 
# the teams which have participated three or more times in IPL
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [ ]:
Using groupby and filter together
    df.groupby('AAA').filter(lambda x: len(x) > 120)

# Merge,  Join. Concatenate

- One of the main ways that databases are structured is to be normalized. 
- Data analysis is more straightforward if all of the data is in a single table.

- df1.append(df2)             stack vertically
- pd.concat([df1, df2])       stacks vertically or horizontally
- df1.join(df2)               inner/outer/left/right join on index (or key column)
- pd.merge([df1,df2])         many joints on multiple columns

## Merge

- Possible to use merge() any time to do database-like join operations. 
- It’s the most flexible of the three operations.



- When you want to combine data objects based on one or more keys i
- More specifically, merge() is most useful when you want to combine rows that share data.



- Possible to achieve many-to-one and many-to-many joins with merge(). 
- In a many-to-one join, 
    - one of the df has many rows in the merge column that repeat the same values (ex: 1, 1, 3, 5, 5)
    - while the merge column in the other dataset will not have repeat values (such as 1, 3, 5).
- In a many-to-many join, 
    - both of your merge columns will have repeat values. 
    - These merges are more complex and result in the Cartesian product of the joined rows.
    - Meaning: after the merge, there are every combination of rows sharing the same value in the key column.



- When you using merge(), two required arguments:
    - The left DataFrame
    - The right DataFrame

In [ ]:
# Example of aplication: mergin on a common column
result = pd.merge(df1, df2[[]'col1', 'col2', 'col3']], on='col1')

##### Syntax

In [ ]:
merge(self, right, how='inner', on=None, left_on=None, right_on=None, 
      left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), 
      copy=True, indicator=False, validate=None) 

The join is done on columns or indexes. 
- If joining columns on columns, the DataFrame indexes will be ignored. 
- Otherwise the index will be passed on.

right:      DataFrame or named Series
            Object to merge with.

how:        {‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘inner’
            - left: use only keys from left frame, preserve key order
            - right: use only keys from right frame, preserve key order.
            - outer: use union of keys from both frames, sort keys lexicographically.
            - inner: use intersection of keys from both frames, preserve the order of the left keys.

on:         label or list
            Column or index level names to join on.
            These MUST be found in both DataFrames. 
            If on is None and not merging on indexes: intersection of the columns in both DataFrames.

left_on:    label or list, or array-like
            Columns from the left DataFrame to use as keys. 
            Can either be column names or arrays with length equal to the length of the DataFrame.

left_index: bool, default False
            If True, use the index (row labels) from the left DataFrame as its join key(s). 
            If used, MUST have right_index as well
            In case of a DataFrame with a MultiIndex (hierarchical):
                - the number of levels must match the number of join keys from the right DataFrame           

************            


sort        bool, default False
            Sort the join keys lexicographically in the result DataFrame. 
            If False, the order of the join keys depends on the join type (how keyword).

suffixes    tuple of (str, str), default (‘_x’, ‘_y’)
            Suffix to apply to overlapping column names in the left and right side, respectively. 
            To raise an exception on overlapping columns use (False, False).

copy        bool, default True
            If False, avoid copy if possible.

indicator   bool or str, default False
            If True, new col called “_merge” with information on the source of each row added
            If string, new col called str with information on source of each row will be added 
            Information column is Categorical-type and takes on a value of 
            - “left_only” for observations whose merge key only appears in ‘left’ DataFrame, 
            - “right_only” for observations whose merge key only appears in ‘right’ DataFrame,
            - “both” if the observation’s merge key is found in both.

validate:   str, optional
            If specified, checks if merge is of specified type.
            - “one_to_one” or “1:1”: check if merge keys are unique in both left and right
            - “one_to_many” or “1:m”: check if merge keys are unique in left 
            - “many_to_one” or “m:1”: check if merge keys are unique in right 
            - “many_to_many” or “m:m”: allowed, but does not result in checks.

##### Example 1 - merging principles

In [303]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo', 'bar'],
                    'value': [1, 2, 3, 5, np.NaN]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz','baz' ,'foo'],
                    'value': [5, 6, np.NaN, 4, 8]})

In [304]:
df1

  lkey  value
0  foo    1.0
1  bar    2.0
2  baz    3.0
3  foo    5.0
4  bar    NaN

In [305]:
df2

  rkey  value
0  foo    5.0
1  bar    6.0
2  baz    NaN
3  baz    4.0
4  foo    8.0

In [310]:
# Merge df1 and df2 on the lkey and rkey columns. 
# The value columns have the default suffixes, _x and _y, appended.
df1.merge(df2, left_on='lkey', right_on='rkey', how='inner')

  lkey  value_x rkey  value_y
0  foo      1.0  foo      5.0
1  foo      1.0  foo      8.0
2  foo      5.0  foo      5.0
3  foo      5.0  foo      8.0
4  bar      2.0  bar      6.0
5  bar      NaN  bar      6.0
6  baz      3.0  baz      NaN
7  baz      3.0  baz      4.0

In [307]:
df1.merge(df2, left_on='lkey', right_on='rkey', how='outer')

  lkey  value_x rkey  value_y
0  foo      1.0  foo      5.0
1  foo      1.0  foo      8.0
2  foo      5.0  foo      5.0
3  foo      5.0  foo      8.0
4  bar      2.0  bar      6.0
5  bar      NaN  bar      6.0
6  baz      3.0  baz      NaN
7  baz      3.0  baz      4.0

##### Example 2

In [270]:
df1 = pd.DataFrame({'ID': ['0011','0013','0014','0016','0017'], 
                           'First Name': ['Joseph', 'Mike', 'Jordan', 'Steven', 'Susan']})
df2 = pd.DataFrame({'ID': ['0010','0011','0013','0014','0017'], 
                           'Last Name': ['Gordan', 'Johnson', 'Might' , 'Jackson', 'Shack']})
df3 = pd.DataFrame({'ID': ['0020','0022','0025'],
                           'First Name': ['Adam', 'Jackie', 'Sue']})
df4 = pd.DataFrame({'Key': ['0020','0022','0025'],
                           'Scores': [95, 90, 80]})
print(df1)
print(df2)

     ID First Name
0  0011     Joseph
1  0013       Mike
2  0014     Jordan
3  0016     Steven
4  0017      Susan
     ID Last Name
0  0010    Gordan
1  0011   Johnson
2  0013     Might
3  0014   Jackson
4  0017     Shack

In [268]:
# how=inner will keep observations that have a match on the merge variable in both data frames.
new_merged_dataframe = pd.merge(df1, df2, on= "ID", how= "inner")
new_merged_dataframe

     ID First Name Last Name
0  0011     Joseph   Johnson
1  0013       Mike     Might
2  0014     Jordan   Jackson
3  0017      Susan     Shack

In [269]:
# Passing the “how = ‘outer'” argument will keep all observations from both data frames.
new_OUTER_merged_dataframe = pd.merge(df1, df2, on= "ID", how= "outer")
new_OUTER_merged_dataframe

     ID First Name Last Name
0  0011     Joseph   Johnson
1  0013       Mike     Might
2  0014     Jordan   Jackson
3  0016     Steven       NaN
4  0017      Susan     Shack
5  0010        NaN    Gordan

In [272]:
# Merging on different columns with unique values
# - If the two data frames each contain the unique identifier, but are stored under different columns
# - It is possible to merge using the left_on and right_on arguments. 
# If going this route, you have to pass both arguments. 
# The general structure is 
   # - left_on = column_name_with_unique_identifier
   # - right_on = column_name_with_unique_identifier.

# Note: Merging data frames this way keep both columns stated in the left_on and right_on arguments.

merged_dataframe = pd.merge(df3, df4, left_on= "ID", right_on= "Key", how= "inner")
merged_dataframe

     ID First Name   Key  Scores
0  0020       Adam  0020      95
1  0022     Jackie  0022      90
2  0025        Sue  0025      80

##### Example 3 - merging using 2 keys

In [311]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [312]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [313]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [314]:
pd.merge(left, right, on=['key1'])

# here the merge is only on key1 - note the repetiiotn of A2 since it is allocated to C1 and C2

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [315]:
pd.merge(left, right, on=['key1', 'key2'])

# what is happening here is important: the merge is done when key1 and key2 are the same

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

##### Example 4 - index renaming, no index label

In [325]:
import pandas as pd
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']})

left.index.set_names('aaa', inplace=True)
right.index.set_names('aaa', inplace=True)

In [326]:
# if the df have same name for index, it is possible to merge using the label of the index
pd.merge(left, right, on='aaa')

      A   B   C   D
aaa
0    A0  B0  C0  D0
1    A1  B1  C2  D2
2    A2  B2  C3  D3

In [327]:
# To note, if the index do not have name, then using this will work (left and right both necessary)
pd.merge(left, right, left_index=True, right_index=True)

      A   B   C   D
aaa
0    A0  B0  C0  D0
1    A1  B1  C2  D2
2    A2  B2  C3  D3

## Join

- While merge() is a module function, .join() is an object function that lives on the DataFrame.
- This enables to specify only one DataFrame, which will join the called DataFrame  .join() on.


- join() uses merge(), but provides a more efficient way to join than a fully specified merge() call. 
- example
    
    df1.join(df2, lsuffix="_left", rsuffix="_right")

    - With the indices visible, this is a left join happening here, with df1 being the left df
    - This example provides the parameters lsuffix and rsuffix. 
    - Because .join() joins on indices and doesn’t directly merge df, all columns, even those with matching names, are retained in the resulting DataFrame.

##### Syntax

In [ ]:
.join(self, other, on=None, how='left', lsuffix='', rsuffix='', sort=False) 

other:  DataFrame, Series, or list of DataFrame
        Index should be similar to one of the columns in this one. 
        
on:     str, list of str, or array-like, optional
        Column or index level name(s) in the caller to join, otherwise joins index-on-index. 
        If multiple values given, the other DataFrame must have a MultiIndex. 
        Can pass an array as the join key if it is not already contained in the calling DataFrame. 
        Like an Excel VLOOKUP operation.

how:    {‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘left’
        How to handle the operation of the two objects.
        - left: use calling frame’s index (or column if on is specified)
        - right: use other’s index.
        - outer: form union of calling frame’s index (or column if on is specified) with other’s index, and sort it. lexicographically.
        - inner: form intersection of calling frame’s index (or column if on is specified) with other’s index, preserving the order of the calling’s one.

lsuffix str, default ‘’
        - Suffix to use from left frame’s overlapping columns.

rsuffix str, default ‘’
        - Suffix to use from right frame’s overlapping columns.

sort    bool, default False
        - Order result DataFrame lexicographically by the join key. 
        - If False, the order of the join key depends on the join type (how keyword).

##### Example

In [316]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [317]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [318]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [319]:
left.join(right)
# to note, inner join (default) will drop the NaN from the left side

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [320]:
left.join(right, how='outer')
# to note, outer join will NOT drop NaN

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Concat

- Concatenation is a bit different from the merging techniques above

- With merging, we expect the resulting dataset 
    - to have rows from the parent datasets mixed in together based on commonality
    - to lose rows that don’t have matches in the other dataset.
    
- With Concatenation
    - datasets are just stitched together along an axis — either the row axis or column axis.

In [257]:
#Example:
concatenated = pd.concat([df1, df2], axis=1)

##### Syntax

In [ ]:
pd.concat( objs, axis=0, join='outer', ignore_index=False, keys=None,
           levels=None, names=None, verify_integrity=False, sort=None, copy=True)


objs:     a sequence or mapping of Series or DataFrame objects
          
axis:     {0/’index’, 1/’columns’}, default 0

join:     {‘inner’, ‘outer’}, default ‘outer’

ignore_index bool, default False
          If True, do not use the index values along the concatenation axis. 
          The resulting axis will be labeled 0, …, n - 1. 
          Useful if where the concatenation axis does not have meaningful indexing information. 


keys:     sequence, default None
          If multiple levels passed, should contain tuples.
          Construct hierarchical index using the passed keys as the outermost level.

levels:   list of sequences, default None
          Specific levels (unique values) to use for constructing a MultiIndex. 
          Otherwise they will be inferred from the keys.

names:    list, default None
          Names for the levels in the resulting hierarchical index.

verify_integrity bool, default False
         Check whether the new concatenated axis contains duplicates. 
         This can be very expensive relative to the actual data concatenation.

sort:    bool, default False
         Sort non-concatenation axis if it is not already aligned when join is ‘outer’. 
         No effect if join='inner' (already preserves the order of the non-concatenation axis)

##### Simple Examples

In [258]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [259]:
# reset the index with ignore_index
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [260]:
# Add a hierarchical index at the outermost level of the data with the keys option.
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [261]:
# Label the index keys you create with the names option.
pd.concat([s1, s2], keys=['s1', 's2'],names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [263]:
# Combine two DataFrame objects with identical columns.
df1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],columns=['letter', 'number'])
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [264]:
# Combine DataFrame objects with overlapping columns and return everything. 
# Columns outside the intersection will be filled with NaN values.
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],columns=['letter', 'number', 'animal'])

pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [265]:
# Combine DataFrame objects with overlapping columns and return only those that are shared 
# by passing inner to the join keyword argument.
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

# Notes

## Check Installed versions

In [ ]:
Show installed versions

pd.__version__             # displays panda verions
pd.show_verions()          # displays version of everything (machine, windows, python, etc)

## Fast way to create a DataFrame

In [13]:
import numpy as np
import pandas as pd

pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.803286,0.279700,0.576213,0.955096,0.246170,0.617426,0.472506,0.732664
1,0.188261,0.580582,0.162590,0.093755,0.877698,0.833847,0.684942,0.888539
2,0.207034,0.020842,0.876282,0.497361,0.170773,0.868600,0.860403,0.647862
3,0.982542,0.390581,0.238227,0.734361,0.270046,0.270311,0.500925,0.963907

## Create df from clipboard

In [ ]:
After having copied a dataset from excel, do this:
    
    df= pd.read_clipboard()

## Args & Kwargs

In [ ]:
'*args' and '**kwargs' are magic variables
   - it is not necessary to write *args or **kwargs. 
   - Only the * (aesteric) is necessary. 
   - You could have also written *var and **vars. 
   - Writing *args and **kwargs is just a convention

In [ ]:
*args and **kwargs are mostly used in function definitions. 
*args and **kwargs allow you to pass a variable number of arguments to a function. 

When you do not know before hand how many arguments can be passed
 - *args is used to send a non-keyworded variable length argument list to the function. 
 - **kwargs allows you to pass keyworded variable length of arguments to a function (named arguments)

- arg creates tuples, kwarg creates dictionary
- by using kwarg, it is possible to name the arguments (which is not possible in arg)

https://www.listendata.com/2019/07/args-and-kwargs-in-python.html

###### Example: *arg

In [286]:
def add(*args):
     print(sum(args))
add(5,5,6)

16

In [287]:
# list comprehension - makes code more readable and fast than a for loop and lambda function
def even(*args):
    print([n for n in args if n%2 == 0])
even(1,2,3,4)

[2, 4]

###### Example: **kwarg

In [288]:
def test2(**kwargs):
    print(kwargs)
    print(kwargs.keys())
    print(kwargs.values())
test2(a=1, b=3)

{'a': 1, 'b': 3}
dict_keys(['a', 'b'])
dict_values([1, 3])

## Display Settings and Style

##### Display Settings

In [ ]:
# To disply 2 decimals

pd.set_options('display.float_format',{:.2f}.format)
pd.reset_options('display.float_format')

display can be:
    - float_format
    - colheader_justify, column_space, date_dayfirst, date_yearfirst
    - max_categories, max_columns, max_colwidth, max_rows, min_rows, precision

    https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.set_option.html

##### Style to next level

In [ ]:
# This is cool - an example

my_format = {'Date': '{%d / % m / %y}',      
             'Col1': '${:.2f}',                      # for $ signs and 2 decinals
             'Col2': '{:,}' }                        # for thousands separator

# Then pass the formting to the df

df.style.format(my_format)
hide_index())                                        # remove index
hightlight_min('Col1', color = 'red')                # highlight min value in Col1 in red
hightlight_max('Col2', color = 'lightgreen')         # highlight max value in Col2 in green

background_gradient(subset='Col3', cmap='Blues')     # conditional formating with blue gradient
bar('Col4', color='lightblue', align='zero')         # conditional formating with bars

## Profile a DataFrame

In [6]:
# - pip install pandas-profiling[notebook]           # pip install
# - conda install -c conda-forge pandas-profiling    # in anaconda prompt
# - pip install https://github.com/pandas-profiling/pandas-profiling/archive/master.zip    # github

from pandas_profiling import ProfileReport
pandas_profiling.ProfileReport(df)

NameError: name 'pandas_profiling' is not defined

## Syntax

In [ ]:
Those are exaclty ok and produce the same

df1 = df[df['col1'] == df['col1'].min()]
df1 = df[df.col1 == df.col1.min()]

## Inplace

In [ ]:
By default, inplace=False, so that we can experiment, try and play with the data
When toggling inplace=True, we will affect 'permanently' the underlying data

inplace is used in formula such as (and many more)
- dropna()
- set_index()
- drop()

as an example, those two are similar 
- inplace        df.set_index('name',inplace=True)
- assignment:    df = df.set_index('name')

## Reduce df file size

In [ ]:
When importing, use this:
    df = pd.read_csv("file_name.csv", usecols=cols, dtype=dtypes)
    
To check for memory usage:
    df.info(memory_usage='deep')
    
File size can be divided by 10x, depending on data characteristics

## Create a pivot table

In [ ]:
df.pivot_table(index=['AAA','BBB'],
              columns=['XYZ'],
              Values='Col1',
              aggfunc=['np.mean','count']    # 'np.sum'
              margins=True,                  # this is to provide total columns and rows, if needed
              fill_value=0)                  # replaces missing values / NaN with 0 
               
https://pbpython.com/pandas-pivot-table-explained.html

## Reshape a Multiindexed Series

In [ ]:
This is exaclty the same - provides the mean of values in Col1 grouped by AAA
    df.groupby('AAA').Col1.mean()
    df.groupby('AAA')['Col1'].mean()
    
It is possible to extend that to a multi-index - the output will be vertical
     df.groupby(['AAA','BBB'])['Col1'].mean()
    
In order to have a nicer looking output (like a pivot table)
    df.groupby(['AAA','BBB'])['Col1'].mean().unstack()

## Convert a Continous into Discrete - with Bins

In [ ]:
Use this (need to have more bins than labels)
    pd.cut(df['col1'], bins =[0,2,5,10], labels=['low','med','high'])

## Split String in Multiple Columns

In [ ]:
Will create new df with those:
    df['Col1'].str.split(' ', expand=True)    # expand on space (if no space, expands each letter)
    df['Col1]'.str.split(',', expand=True)    # expand on coma

## Aggregate by Multiple functions

In [ ]:
In the example, we had 'Orders_ID' and the detail of 'Item_Price' of those 'Orders_ID'

    # those are the same, they return the sum of Item_Price for Order_ID 1
    df.[df['Order_ID']==1]['Item_Price'].sum()
    df.[df.Order_ID ==1].Item_Price'.sum()

    # this creates a df with Order_IDs and sum of Item_Price
    df.groupby('Order_ID')['Item_Price'].sum() 
    
    # this creates a df with 2 columns with sum and count 
    df.groupby('Order_ID')['Item_Price'].agg(['sum','count'])    
    
To take this to the next level and integrate this information back to the original df
We want to Combine the outpout of an aggregation with a Dataframe

Solution is to use the TRANSFORM method 
Transform performs same calculation but returns output data with same shape as original
    
    # This creates the array 'df2'
    df2 = df.groupby('Order_ID')['Item_Price'].transform('sum') 
    
    # This adds a new column 'Total Price' in the original df, using df2 data
    df['Total_Price'] = df2

    # This creates a new columns 'Percent_Order' 
    df['Percent_Order'] = df.Item_Price / df.Total_Price

## Build DF from multiple files (Rows and Column wise)

In [ ]:
Need to install the Glob module and have in the same place the files we need

    from glob import glob
    # for vertical concatenation (adding rows)
    pd.concat((pd.read_csv(file) for file in AAA_folder, ignore_index=True))
                                                            # this to avoid duplicated indexes at 0
    # for horizontal concatenation (adding columns)
    pd.concat((pd.read_csv(file) for file in AAA_folder, axis=1))

## Get the length of str characters from a column

In [ ]:
We call this custom methods:

.apply(lambda x: len(x))'
.apply(len)

# TEST

# TEST 2

In [ ]:
good blog: https://www.novixys.com/blog/author/admin/